# Fundamentals of Data Analysis Tasks

**Kevin Donovan**

****

## Task 1

> The Collatz conjecture is a famous unsolved problem in mathematics. The problem is to prove that if you start with any positive integer x and repeatedly apply the function $f(x)$ below, you always get stuck in the repeating sequence 1, 4, 2, 1, 4, 2, ...

In [ ]:
def f(x):
    # If x is even divide it by two. Using the modulo command % to give the remainder of the division
    if x % 2 == 0:
        return x // 2
    else:
        return (3 * x) + 1

In [ ]:
def collatz(x):
    print(f'Testing the Collatz conjecture using the initial value {x}') 
    count = 0
    value = x
    for i in range(1, x, 1):
        print("i = ", i)
        count += 1
        x = value
        while x != 1:
            print(x, end = ', ')
            x = f(x)
        print("x is: ", x)
        value = value - 1
        print("value is; ", value)
    print("count : ", count)
    #print(x)

In [ ]:
collatz(50)

****

# End of Task 1

# Task 2

**Penguins data analysis**

****

The penguns data set contains 345 sets of data relating to three species of penguin. The Data was collected by Dr. Kristen Gorman (https://www.uaf.edu/cfos/people/faculty/detail/kristen-gorman.php) and the Palmer Station, Antarctica LTER (https://pallter.marine.rutgers.edu/), a member of the Long Term Ecological Research Network (https://lternet.edu/).

In [1]:
import pandas as pd
Penguins_Dataset = 'penguins.csv'

df = pd.read_csv(Penguins_Dataset, header=None)
df

,0,1,2,3,4,5,6
0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
1,Adelie,Torgersen,39.1,18.7,181,3750,MALE
2,Adelie,Torgersen,39.5,17.4,186,3800,FEMALE
3,Adelie,Torgersen,40.3,18,195,3250,FEMALE
4,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
340,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
341,Gentoo,Biscoe,46.8,14.3,215,4850,FEMALE
342,Gentoo,Biscoe,50.4,15.7,222,5750,MALE
343,Gentoo,Biscoe,45.2,14.8,212,5200,FEMALE
344,Gentoo,Biscoe,49.9,16.1,213,5400,MALE

As can be seen in the data from the dataframe, there are a number of NaN cells, this means "Not a Number". In the data it is seen that there are at least two rows of missing data which could skew our results.

****

# End of task 2